PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tdm.h
#include "cy_device.h"

#if defined (CY_IP_MXTDM)

#include "cy_syslib.h"
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 14.3', 14, \
                             'Checked manually, passed true or false in _BOOL2FLD for appropriate functionality.')

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 14, \
                             'Checked manually, passed true or false in _BOOL2FLD for appropriate functionality.')

/******************************************************************************
 * Macro definitions                                                          *
 ******************************************************************************/

/**
* \addtogroup group_tdm_macros
* \{
*/

/** The driver major version */
#define CY_I2S_DRV_VERSION_MAJOR       1

/** The driver minor version */
#define CY_I2S_DRV_VERSION_MINOR       0

/** The TDM driver identifier */
#define CY_TDM_ID                      (CY_PDL_DRV_ID(0x50U))

/** \} group_tdm_macros */

/**
* \addtogroup group_tdm_i2s_macros_interrupt_masks
* \{
*/

/** Bit 0: Less entries in the TX FIFO than specified by Trigger Level. */
#define CY_TDM_INTR_TX_FIFO_TRIGGER         (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_FIFO_TRIGGER_Msk)
/** Bit 1: Attempt to write to a full TX FIFO. */
#define CY_TDM_INTR_TX_FIFO_OVERFLOW        (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_FIFO_OVERFLOW_Msk)
/** Bit 2: Attempt to read from an empty TX FIFO. */
#define CY_TDM_INTR_TX_FIFO_UNDERFLOW       (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_FIFO_UNDERFLOW_Msk)
/** Bit 8: Interface frequency is higher than PCM sample frequency. */
#define CY_TDM_INTR_TX_IF_UNDERFLOW         (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_IF_UNDERFLOW_Msk)

/** Bit 0: Less entries in the RX FIFO than specified by Trigger Level. */
#define CY_TDM_INTR_RX_FIFO_TRIGGER         (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_FIFO_TRIGGER_Msk)
/** Bit 1: Attempt to write to a full RX FIFO. */
#define CY_TDM_INTR_RX_FIFO_OVERFLOW        (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_FIFO_OVERFLOW_Msk)
/** Bit 2: Attempt to read from an empty RX FIFO. */
#define CY_TDM_INTR_RX_FIFO_UNDERFLOW       (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_FIFO_UNDERFLOW_Msk)
/** Bit 8: Interface frequency is higher than PCM sample frequency. */
#define CY_TDM_INTR_RX_IF_UNDERFLOW         (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_IF_OVERFLOW_Msk)

/** \} group_tdm_i2s_macros_interrupt_masks */


/**
* \addtogroup group_tdm_enums
* \{
*/

/** cy_en_tdm_ws_t */
typedef enum
{
    CY_TDM_SIZE_8           = 0U, /**< PCM word size:8bit.  */
    CY_TDM_SIZE_10          = 1U, /**< PCM word size:10bit. */
    CY_TDM_SIZE_12          = 2U, /**< PCM word size:12bit. */
    CY_TDM_SIZE_14          = 3U, /**< PCM word size:14bit. */
    CY_TDM_SIZE_16          = 4U, /**< PCM word size:16bit. */
    CY_TDM_SIZE_18          = 5U, /**< PCM word size:18bit. */
    CY_TDM_SIZE_20          = 6U, /**< PCM word size:20bit. */
    CY_TDM_SIZE_24          = 7U, /**< PCM word size:24bit. */
    CY_TDM_SIZE_32          = 8U  /**< PCM word size:32bit. */
} cy_en_tdm_ws_t;

/** cy_en_tdm_format_t */
typedef enum
{
    CY_TDM_LEFT_DELAYED     = 0, /**< Format is left aligned and delayed. */
    CY_TDM_LEFT             = 1, /**< Format is left aligned. */
    CY_TDM_RIGHT_DELAYED    = 2, /**< Format is right aligned and delayed. */
    CY_TDM_RIGHT            = 3  /**< Format is right aligned. */
} cy_en_tdm_format_t;

/** cy_en_tdm_device_cfg_t */
typedef enum
{
    CY_TDM_DEVICE_SLAVE     = 0U, /**< Device is configured as slave. */
    CY_TDM_DEVICE_MASTER    = 1U  /**< Device is configured as master. */
} cy_en_tdm_device_cfg_t;

/** cy_en_tdm_word_extend_cfg_t */
typedef enum
{
    CY_ZERO_EXTEND      = 0U,    /**< Zero extended. */
    CY_SIGN_EXTEND      = 1U    /**< sign extended. */
} cy_en_tdm_word_extend_cfg_t;

/** cy_en_tdm_clock_sel_t */
typedef enum
{
    CY_TDM_SEL_SRSS_CLK0    = 0U, /**< Interface clock is selected as clk_if_srss[0]. */
    CY_TDM_SEL_SRSS_CLK1    = 1U, /**< Interface clock is selected as clk_if_srss[1]. */
    CY_TDM_SEL_SRSS_CLK2    = 2U, /**< Interface clock is selected as clk_if_srss[2]. */
    CY_TDM_SEL_SRSS_CLK3    = 3U, /**< Interface clock is selected as clk_if_srss[3]. */
    CY_TDM_SEL_MCLK_IN      = 4U  /**< Interface clock is selected as tdm_tx/rx_mclk_in. */
} cy_en_tdm_clock_sel_t;

/** cy_en_tdm_sckpolarity_t */
typedef enum
{
    CY_TDM_CLK              = 0U, /**< TDM Clock is used as is. */
    CY_TDM_CLK_INVERTED     = 1U  /**< TDM Clock is inverted. */
} cy_en_tdm_sckpolarity_t;

/** cy_en_tdm_fsyncpolarity_t*/
typedef enum
{
    CY_TDM_SIGN             = 0U, /**< TDM Sign is used as is. */
    CY_TDM_SIGN_INVERTED    = 1U  /**< TDM Sign is inverted. */
} cy_en_tdm_fsyncpolarity_t;

/** cy_en_tdm_fsyncformat_t */
typedef enum
{
    CY_TDM_BIT_PERIOD       = 0U, /**< TDM Channel Synchronization is duration of a bit period. */
    CY_TDM_CH_PERIOD        = 1U  /**< TDM Channel Synchronization is duration of a channel period. */
} cy_en_tdm_fsyncformat_t;

/**
* TDM status definitions.
*/
typedef enum
{
    CY_TDM_SUCCESS          = 0x00UL,                                     /**< Successful. */
    CY_TDM_BAD_PARAM        = CY_TDM_ID | CY_PDL_STATUS_ERROR | 0x01UL  /**< One or more invalid parameters. */
} cy_en_tdm_status_t;

/** cy_en_tdm_source_status_t */
typedef enum
{
    CY_TDM_OK                = 0x00UL, /**< Successful. */
    CY_TDM_BAD               = 0x01UL  /**< Not Good    */
} cy_en_tdm_source_status_t;

/** \} group_tdm_enums */

/**
* \addtogroup group_tdm_data_structures
* \{
*/
/** TDM Initialization configuration. */
typedef struct
{
    bool                        enable;               /**<  Enables/Disables TDM TX */
    cy_en_tdm_device_cfg_t      masterMode;           /**<  Master mode/Slave mode configuration. \ref cy_en_tdm_device_cfg_t */
    cy_en_tdm_ws_t              wordSize;             /**<  TX word length. Channel size must be greater or equal to the word size.*/
    cy_en_tdm_format_t          format;               /**<  TX data format, \ref cy_en_tdm_format_t. */
    uint16_t                    clkDiv;               /**<  Should be set to an even value ({2, 4, 6, ..., 256}), to ensure a 50/50% duty cycle clock. Only for Master Mode */
    cy_en_tdm_clock_sel_t       clkSel;               /**<  Interface clock "clk_if" selection, \ref cy_en_tdm_clock_sel_t. */
    cy_en_tdm_sckpolarity_t     sckPolarity;          /**<  TX clock polarity, 0: as is and 1: inverted \ref cy_en_tdm_sckpolarity_t */
    cy_en_tdm_fsyncpolarity_t   fsyncPolarity;        /**<  Synchronization polarity:0:as is 1:inverted. \ref cy_en_tdm_fsyncpolarity_t*/
    cy_en_tdm_fsyncformat_t     fsyncFormat;          /**<  Channel synchronization pulse format \ref cy_en_tdm_fsyncformat_t */
    uint8_t                     channelNum;           /**<  Number of channels in the frame:
                                                            1 to 32 channels supported. In I2S mode number of channels should be 2. */
    uint8_t                     channelSize;          /**<  Channel Size. Channel size must be greater or equal to the word size. */
    uint8_t                     fifoTriggerLevel;     /**<  Trigger level. When the TX FIFO has less entries than the number of this field, a transmitter trigger event is generated. */
    uint32_t                    chEn;                 /**<  Channels enabled: channel i is controlled by bit chEn[i]. For example : In I2S mode for 2 channels the chEn  will be 0x3 */
    uint32_t                    signalInput;          /**<  Controls routing to the TX slave signaling  inputs (FSYNC/SCK):
                                                              '0': TX slave signaling independent from RX signaling :
                                                              '1': TX slave signaling inputs driven by RX Slave:
                                                              '2': TX slave signaling inputs driven by RX Master: */
    bool                        i2sMode;              /**<  IF set to 1 the IP is configured for I2S mode else for TDM mode    */
} cy_stc_tdm_config_tx_t;

/** cy_stc_tdm_config_rx_t */
typedef struct
{
    bool                        enable;               /**<  Enables/Disables TDM RX */
    cy_en_tdm_device_cfg_t      masterMode;           /**<  Master mode/Slave mode configuration. \ref cy_en_tdm_device_cfg_t */
    cy_en_tdm_ws_t              wordSize;             /**<  RX word length. Channel size must be greater or equal to the word size.*/
    cy_en_tdm_word_extend_cfg_t signExtend;           /**<  Word extension \ref cy_en_tdm_word_extend_cfg_t */
    cy_en_tdm_format_t          format;               /**<  RX data format, \ref cy_en_tdm_format_t. */
    uint16_t                    clkDiv;               /**<  Should be set to an even value ({2, 4, 6, ..., 256}), to ensure a 50/50% duty cycle clock. Only for Master Mode */
    cy_en_tdm_clock_sel_t       clkSel;               /**<  Interface clock "clk_if" selection, \ref cy_en_tdm_clock_sel_t. */
    cy_en_tdm_sckpolarity_t     sckPolarity;          /**<  RX clock polarity, 0: as is and 1: inverted \ref cy_en_tdm_sckpolarity_t */
    cy_en_tdm_fsyncpolarity_t   fsyncPolarity;        /**<  Channel synchronization polarity:'false':used "as is". 'true': inverted. */
    bool                        lateSample;           /**<  Interface late sample delay.
                                                          *   Slave configuration: "false": Sample PCM bit value on rising edge or falling edge of receiver "rx_sck_in
                                                          *   "true": Sample PCM bit value on falling edge or rising edge of receiver "rx_sck_in" (half a cycle delay).
                                                          *   Master configuration: "false": Sample PCM bit value on rising edge or falling edge of receiver "rx_sck_out".
                                                          *   "true": Sample PCM bit value on falling edge or rising edge of receiver "rx_sck_out" (half a cycle delay). */
    /**<  RISING = 0  FALLING = 1 */
    cy_en_tdm_fsyncformat_t     fsyncFormat;          /**<  Channel synchronization pulse format \ref cy_en_tdm_fsyncformat_t */
    uint8_t                     channelNum;           /**<  Number of channels in the frame:
                                                            1 to 32 channels supported. In I2S mode number of channels should be 2. */
    uint8_t                     channelSize;          /**<  Channel Size. Channel size must be greater or equal to the word size. */
    uint32_t                    chEn;                 /**<  Channels enabled: channel i is controlled by bit chEn[i]. For example : In I2S mode for 2 channels the chEn  will be 0x3 */
    uint8_t                     fifoTriggerLevel;     /**<  Trigger level. When the TX FIFO has less entries than the number of this field, a transmitter trigger event is generated. */
    uint32_t                    signalInput;          /**<  Controls routing to the RX slave signaling  inputs (FSYNC/SCK):
                                                              '0': RX slave signaling independent from TX signaling :
                                                              '1': RX slave signaling inputs driven by TX Slave:
                                                              '2': RX slave signaling inputs driven by TX Master: */
    bool                        i2sMode;              /**<  IF set to 1 the IP is configured for I2S mode else for TDM mode    */
} cy_stc_tdm_config_rx_t;

