PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tdm.h
#define Cy_AudioI2S_EnableTx                              Cy_AudioTDM_EnableTx
#define Cy_AudioI2S_DisableTx                              Cy_AudioTDM_DisableTx
#define Cy_AudioI2S_EnableRx                               Cy_AudioTDM_EnableRx
#define Cy_AudioI2S_DisableRx                           Cy_AudioTDM_DisableRx

#define Cy_AudioI2S_WriteTxData                           Cy_AudioTDM_WriteTxData
#define Cy_AudioI2S_FreezeTxFifo                           Cy_AudioTDM_FreezeTxFifo
#define Cy_AudioI2S_UnfreezeTxFifo                         Cy_AudioTDM_UnfreezeTxFifo
#define Cy_AudioI2S_MuteTxFifo                          Cy_AudioTDM_MuteTxFifo
#define Cy_AudioI2S_ActivateTx                             Cy_AudioTDM_ActivateTx
#define Cy_AudioI2S_DeActivateTx                           Cy_AudioTDM_DeActivateTx
#define Cy_AudioI2S_ReplayTxFifo                          Cy_AudioTDM_ReplayTxFifo
#define Cy_AudioI2S_GetNumInTxFifo                         Cy_AudioTDM_GetNumInTxFifo
#define Cy_AudioI2S_GetTxReadPointer                      Cy_AudioTDM_GetTxReadPointer
#define Cy_AudioI2S_GetTxWritePointer                      Cy_AudioTDM_GetTxWritePointer
#define Cy_AudioI2S_EnableTxTestMode                       Cy_AudioTDM_EnableTxTestMode
#define Cy_AudioI2S_DisableTxTestMode                   Cy_AudioTDM_DisableTxTestMode

#define Cy_AudioI2S_ReadRxData                          Cy_AudioTDM_ReadRxData
#define Cy_AudioI2S_FreezeRxFifo                          Cy_AudioTDM_FreezeRxFifo
#define Cy_AudioI2S_UnfreezeRxFifo                         Cy_AudioTDM_UnfreezeRxFifo
#define Cy_AudioI2S_ActivateRx                          Cy_AudioTDM_ActivateRx
#define Cy_AudioI2S_DeActivateRx                          Cy_AudioTDM_DeActivateRx
#define Cy_AudioI2S_ReadSilentRXFifo                      Cy_AudioTDM_ReadSilentRXFifo
#define Cy_AudioI2S_GetNumInRxFifo                         Cy_AudioTDM_GetNumInRxFifo
#define Cy_AudioI2S_GetRxReadPointer                    Cy_AudioTDM_GetRxReadPointer
#define Cy_AudioI2S_GetRxWritePointer                      Cy_AudioTDM_GetRxWritePointer
#define Cy_AudioI2S_EnableRxTestMode                      Cy_AudioTDM_EnableRxTestMode
#define Cy_AudioI2S_DisableRxTestMode                      Cy_AudioTDM_DisableRxTestMode

#define Cy_AudioI2S_ClearTxInterrupt                      Cy_AudioTDM_ClearTxInterrupt
#define Cy_AudioI2S_SetTxInterrupt                         Cy_AudioTDM_SetTxInterrupt
#define Cy_AudioI2S_GetTxInterruptMask                  Cy_AudioTDM_GetTxInterruptMask
#define Cy_AudioI2S_SetTxInterruptMask                  Cy_AudioTDM_SetTxInterruptMask
#define Cy_AudioI2S_GetTxInterruptStatusMasked          Cy_AudioTDM_GetTxInterruptStatusMasked
#define Cy_AudioI2S_SetTxTriggerInterruptMask           Cy_AudioTDM_SetTxTriggerInterruptMask
#define Cy_AudioI2S_ClearTxTriggerInterruptMask         Cy_AudioTDM_ClearTxTriggerInterruptMask

#define Cy_AudioI2S_ClearRxInterrupt                      Cy_AudioTDM_ClearRxInterrupt
#define Cy_AudioI2S_SetRxInterrupt                         Cy_AudioTDM_SetRxInterrupt
#define Cy_AudioI2S_GetRxInterruptMask                  Cy_AudioTDM_GetRxInterruptMask
#define Cy_AudioI2S_SetRxInterruptMask                  Cy_AudioTDM_SetRxInterruptMask
#define Cy_AudioI2S_GetRxInterruptStatusMasked          Cy_AudioTDM_GetRxInterruptStatusMasked
#define Cy_AudioI2S_SetRxTriggerInterruptMask           Cy_AudioTDM_SetRxTriggerInterruptMask
#define Cy_AudioI2S_ClearRxTriggerInterruptMask         Cy_AudioTDM_ClearRxTriggerInterruptMask

/** \endcond */

/** \} group_tdm_functions */

/**
* \addtogroup group_tdm_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_AudioTDM_EnableTx
****************************************************************************//**
*
* Starts an I2S/TDM transmission. Interrupt enabling (by the
* \ref Cy_AudioTDM_SetTxInterrupt) is required after this function call, in case
* if any I2S/TDM interrupts are used in the application.
*
* \pre Cy_AudioTDM_Init() must be called before.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_EnableTx
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_EnableTx(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_CTL(base) |= TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_DisableTx
****************************************************************************//**
*
* Stops an I2S/TDM transmission.
*
* \pre TX interrupt disabling (by the \ref Cy_AudioTDM_SetTxInterrupt) is required
* prior to this function call, in case any TX I2S/TDM interrupts are used.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_DisableTx
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DisableTx(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_CTL(base) &= (uint32_t) ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_EnableRx
****************************************************************************//**
*
* Starts an I2S/TDM transmission. Interrupt enabling (by the
* \ref Cy_AudioTDM_SetRxInterrupt) is required after this function call, in case
* if any I2S/TDM interrupts are used in the application.
*
* \pre Cy_AudioTDM_Init() must be called before.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_EnableRx
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_EnableRx(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_CTL(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_ENABLED_Msk;
}

