PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tdm.h
/*******************************************************************************
* Function Name: Cy_AudioTDM_DisableRx
****************************************************************************//**
*
* Stops an I2S/TDM transmission.
*
* \pre TX interrupt disabling (by the \ref Cy_AudioTDM_SetRxInterrupt) is required
* prior to this function call, in case any TX I2S/TDM interrupts are used.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_DisableRx
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_DisableRx(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_CTL(base) &= (uint32_t) ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_WriteTxData
****************************************************************************//**
*
* Writes data to the TX FIFO. Increases the TX FIFO level.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \param data Data to be written to the TX FIFO.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_WriteTxData
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_WriteTxData(TDM_TX_STRUCT_Type * base, uint32_t data)
{
    TDM_STRUCT_TX_FIFO_WR(base) = data;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_FreezeTxFifo
****************************************************************************//**
*
* Freezes the TX FIFO. This function is for debug purposes.
* HW uses a constant PCM data value of "0" or the previous channel PCM data is replayed.
* Freeze does not advance the FIFO read pointer (the FIFO data is not used).
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_FreezeTxFifo
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_FreezeTxFifo(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE, 1U) |
                                    _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY, 0U);
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_UnfreezeTxFifo
****************************************************************************//**
*
* Unfreezes the TX FIFO. This function is for debug purposes.
* HW uses TX FIFO data and advances the FIFO read pointer.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_UnFreezeTxFifo
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_UnfreezeTxFifo(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE, 0U);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_MuteTxFifo                                   */
/***************************************************************************//**
*
* Mutes the TX FIFO.
* HW uses a constant PCM data value of "0". Mute does advance the FIFO read pointer.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_MuteTxFifo
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_MuteTxFifo(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_MUTE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_MUTE, 1U);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ActivateTx                                      */
/***************************************************************************//**
*
* Activate/start the TX FIFO.
* This will set the transmitter state to on.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_ActivateTx
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ActivateTx(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE, 1U);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DeActivateTx                                       */
/***************************************************************************//**
*
* Stop the TX FIFO.
* This will set the transmitter state to off.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_DeActivateTx
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DeActivateTx(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE, 0U);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_ReplayTxFifo                           */
/***************************************************************************//**
*
* Replay functionality (used when FREEZE is '1' or in case of a FIFO underflow event).
* HW uses the previous PCM data value.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
//data replay
__STATIC_INLINE void Cy_AudioTDM_ReplayTxFifo(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE, 1U) |
                                    _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY, 1U);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetNumInTxFifo                               */
/***************************************************************************//**
*
* Gets the number of used words in the TX FIFO.,
* Number of used/occupied entries in the TX FIFO. The field value is in the range [0, 128].
* When "0", the FIFO is empty. When "128", the FIFO is full.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The current number of used words in the TX FIFO.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetNumInTxFifo
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetNumInTxFifo(TDM_TX_STRUCT_Type * base)
{
    return ((uint8_t)(TDM_STRUCT_TX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_USED_Msk));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetTxReadPointer                             */
/***************************************************************************//**
*
* Get the TX FIFO Read Pointer.
* TX FIFO read pointer: FIFO location from which a data is read.
* This functionality is intended for debugging purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetTxReadPointer
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetTxReadPointer(TDM_TX_STRUCT_Type * base)
{
    uint32_t reg_value;
    reg_value = (TDM_STRUCT_TX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_RD_PTR_Msk);
    return ((uint8_t)(reg_value >> TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_RD_PTR_Pos));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetTxWritePointer                            */
/***************************************************************************//**
*
* Get the TX FIFO Write Pointer.
* TX FIFO write pointer: FIFO location at which a new data is written by the hardware.
* This functionality is intended for debugging purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetTxWritePointer
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetTxWritePointer(TDM_TX_STRUCT_Type * base)
{
    uint32_t reg_value;
    reg_value = (TDM_STRUCT_TX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_WR_PTR_Msk);
    return ((uint8_t)(reg_value >> TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_WR_PTR_Pos));
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_EnableTxTestMode                            */
/***************************************************************************//**
*
* Enables the test mode. Used for debugging purposes only.
* Tx and Rx test modes cannot be enabled simultaneously.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_EnableTxTestMode(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_TEST_CTL(base) |= TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_TEST_CTL_ENABLED_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DisableTxTestMode                            */
/***************************************************************************//**
*
* Disables Test mode.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DisableTxTestMode(TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_TEST_CTL(base) &= (uint32_t) ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_TEST_CTL_ENABLED_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ReadRxData                                   */
/***************************************************************************//**
*
* Read Rx data from the Rx FIFO.
* Data (PCM sample) read from the RX FIFO. Reading removes the data from the RX FIFO.
* Reading from an empty RX FIFO activates FIFO_UNDERFLOW interrupt.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_ReadRxData
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_ReadRxData(TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_RD(base));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_FreezeRxFifo                                 */
/***************************************************************************//**
*
* Freeze RX FIFO.
* HW writes from the RX FIFO have no effect: freeze will not advance the FIFO write pointer.
* This functionality is intended for debugging purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_FreezeRxFifo
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_FreezeRxFifo(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_RX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE, 1U);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_UnfreezeRxFifo                               */
/***************************************************************************//**
*
* UnFreeze Rx FIFO.
* HW writes to the RX FIFO and advances the FIFO write pointer.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_UnfreezeRxFifo
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_UnfreezeRxFifo(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_RX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE, 0U);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ActivateRx                                      */
/***************************************************************************//**
*
* Start Rx FIFO.
* Sets Receiver state to on.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_ActivateRx
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ActivateRx(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DeActivateRx                                       */
/***************************************************************************//**
*
* Stop Rx FIFO.
* Sets Receiver state to off.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_DeActivateRx
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DeActivateRx(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE_Msk;
    TDM_STRUCT_RX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE, 0U);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ReadSilentRXFifo                             */
/***************************************************************************//**
*
* When the RX FIFO is empty, a read from this register returns "0".
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_ReadSilentRXFifo
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_ReadSilentRXFifo(TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_RD_SILENT(base));
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetNumInRxFifo                               */
/***************************************************************************//**
*
* Reads RX FIFO status.
* Number of used/occupied entries in the RX FIFO. The field value is in the range [0, 128].
* When "0", the FIFO is empty. When "128", the FIFO is full.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetNumInRxFifo
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetNumInRxFifo(TDM_RX_STRUCT_Type * base)
{
    return ((uint8_t)(TDM_STRUCT_RX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_USED_Msk));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetRxReadPointer                            */
/***************************************************************************//**
*
* Reads RX FIFO Read Pointer
* RX FIFO read pointer: FIFO location from which a data is read.
* This functionality is intended for debugging purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The current RX Read pointer value.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetRxReadPointer
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetRxReadPointer(TDM_RX_STRUCT_Type * base)
{
    uint32_t reg_value;
    reg_value = (TDM_STRUCT_RX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_RD_PTR_Msk);
    return ((uint8_t)(reg_value >> TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_RD_PTR_Pos));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetRxWritePointer                            */
/***************************************************************************//**
*
* Reads RX FIFO Write Pointer
* RX FIFO write pointer: FIFO location at which a new data is written by the hardware.
* This functionality is intended for debugging purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The current RX Write pointer value.
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_GetRxWritePointer
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetRxWritePointer(TDM_RX_STRUCT_Type * base)
{
    uint32_t reg_value;
    reg_value = (TDM_STRUCT_RX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_WR_PTR_Msk);
    return ((uint8_t)(reg_value >> TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_WR_PTR_Pos));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_EnableRxTestMode                             */
/***************************************************************************//**
*
* Enables Test mode (intended to be used with (master transmitter, slave receiver) configuration).
* Both TX and RX should not be set in Test mode simultaneously.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_EnableRxTestMode(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_TEST_CTL(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_TEST_CTL_ENABLED_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DisableRxTestMode                            */
/***************************************************************************//**
*
* Disable RX test mode
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DisableRxTestMode(TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_TEST_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_TEST_CTL_ENABLED_Msk;
    TDM_STRUCT_RX_TEST_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_TEST_CTL_ENABLED, 0U);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ClearTxInterrupt                             */
/***************************************************************************//**
*
* Clear TX interrupt
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupt
*
* \funcusage
* \snippet tdm/snippet/main.c snippet_Cy_AudioTDM_ClearTxInterrupt
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ClearTxInterrupt(TDM_TX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_TX_MASK_VALID(interrupt));

